jordanh/idigi-arduino-connector/dvt/platforms/pic32/ethstarterkit32.X/main.c
#define THIS_IS_STACK_APPLICATION

// Include all headers for any enabled TCPIP Stack functions
#include "TCPIP Stack/TCPIP.h"

#include "idigi_app.h"

#define RED_LED             BIT_0
#define YELLOW_LED          BIT_1
#define GREEN_LED           BIT_2

#define SW1                 BIT_6
#define SW2                 BIT_7
#define SW3                 BIT_13

static void InitializeBoard(void);
static void InitAppConfig(void);
static void InitIDigiConfig(void);
static int get_uptime(void);
static void toggle_led(unsigned int);
idigi_callback_status_t idigi_callback(idigi_class_t const class_id,
                                        idigi_request_t const request_id,
                                        void const * const request_data,
                                        size_t const request_length,
                                        void * response_data,
                                        size_t * const response_length);


static unsigned short wOriginalAppConfigChecksum;	// Checksum of the ROM defaults for AppConfig
BYTE AN0String[8];
APP_CONFIG AppConfig;
IDIGI_CONFIG idigi_config;

#if defined(__PIC32MX__) && (IDIGI_DATA_SERVICE)
    uint8_t buttons[2] = { SW1, SW2 };
    char * button_text[2] = { "SW1", "SW2" };
    char * button_log_proto = "%5d second uptime : %s Button Pressed.\n";
#endif

#if defined(IDIGI_DATA_SERVICE)
    char * content_type = "text/plain";
    char * path = "log.txt";
    char * connect_log_proto = "%5d second uptime : Connected to %s.\n";
    idigi_data_request_t * data_service_request;
#endif

int main(void){

    // Initialize the Board, including the Network Stack.
    InitializeBoard();

    TickInit();

    // Initialize Stack and application related NV variables into AppConfig.
    InitAppConfig();

    // Initialize iDigi variables into idigi_config.
    InitIDigiConfig();

    // Initialize core stack layers (MAC, ARP, TCP, UDP) and
    // application modules (HTTP, SNMP, etc.)
    StackInit();

    #if defined(IDIGI_DATA_SERVICE)
    {
        data_service_request = malloc(sizeof(idigi_data_request_t));
        data_service_request->content_type.value = content_type;
        data_service_request->content_type.size = strlen(content_type);
        data_service_request->path.value = path;
        data_service_request->path.size = strlen(path);
    }
    #endif

    idigi_handle_t handle = NULL;
    idigi_status_t status = idigi_success;

    unsigned int leds[] = { RED_LED, YELLOW_LED, GREEN_LED };
    unsigned int i = 0;
    int length = sizeof(leds)/sizeof(unsigned int);

    bool ip_assigned = false;
    bool initial_connect = true;
    int connect_time = 0;
    IP_ADDR cur_addr = AppConfig.MyIPAddr;

    while(1){
        StackTask();
        toggle_led(leds[i]);
        i++;
        if(i > length-1){
            i = 0;
        }
        if(cur_addr.Val != AppConfig.MyIPAddr.Val){
            cur_addr = AppConfig.MyIPAddr;
            if(ip_assigned){
                if(idigi_config.socket_fd != -1 && handle != NULL){
                    // if iDigi connection initialized and socket assigned.
                    // Terminate iDigi connection.  It will reconnect with new
                    // ip.  If it's an Auto IP, connection will fail until
                    // proper found.
                    status = idigi_initiate_action(handle,
                            idigi_initiate_terminate, NULL, NULL);
                    connect_time = 0;
                }
            }
            ip_assigned = true;
        }
        // Until IP Address is assigned, attempt to retrieve IP.
        if(ip_assigned){
            // Initialize IIK, if status is terminated, connection was
            // previously terminated.  Recreate.
            if(handle == NULL || status == idigi_device_terminated){
                if(status == idigi_device_terminated){
                    free(handle);
                }
                // Initialize iDigi Integration Kit.
                handle = idigi_init((idigi_callback_t) idigi_callback);
            }
            // Process next iDigi step.
            status = idigi_step(handle);

            if(!idigi_config.connected && idigi_config.socket_fd != -1){
                // We are now connected.
                int cur_time = get_uptime();
                if(connect_time == 0){
                    connect_time = get_uptime();
                }
                else if(cur_time - 5 > connect_time){
                    // Been 5 second since connection established
                    // Assume discovery complete.
                    // TODO: Make this more intelligent (detect discovery complete?)
                    idigi_config.connected = true;
                    # if defined(IDIGI_DATA_SERVICE)
                    {
                        char buffer[255];
                        int time = SNTPGetUTCSeconds()-5;
                        sprintf(buffer, connect_log_proto, time, idigi_config.server_url);
                        data_service_request->payload.data = buffer;
                        data_service_request->payload.size = strlen(buffer);
                        data_service_request->flag = IDIGI_DATA_REQUEST_START | IDIGI_DATA_REQUEST_LAST;
                        if(!initial_connect){ // Append if this is a reconnect.
                            data_service_request->flag |= IDIGI_DATA_REQUEST_APPEND;
                        }
                        status = idigi_initiate_action(handle, idigi_initiate_data_service, data_service_request, &data_service_request->session);
                    }
                    #endif
                    initial_connect = false;
                    connect_time = 0;
                }
            }

            #if defined(__PIC32MX__) && defined(IDIGI_DATA_SERVICE)
            {
                int switch_on;
                int i=0;
                while(idigi_config.connected && i < 2){
                    switch_on = mPORTDReadBits(buttons[i]);
                    if(switch_on == 0){
                        char buffer[50];
                        int time = SNTPGetUTCSeconds();
                        sprintf(buffer, button_log_proto, time, button_text[i]);
                        data_service_request->payload.data = buffer;
                        data_service_request->payload.size = strlen(buffer);
                        data_service_request->flag = IDIGI_DATA_REQUEST_START | IDIGI_DATA_REQUEST_LAST | IDIGI_DATA_REQUEST_APPEND;
                        status = idigi_initiate_action(handle, idigi_initiate_data_service, data_service_request, &data_service_request->session);
                        sleep(200); // sleep 200ms to prevent 1 button press being registered multiple times.
                    }
                    i++;
                }
            }
            #endif
        }
        sleep(50);
    }
}

static int get_uptime(void){
    uint32_t cur_time = TickGet() / TICKS_PER_SECOND;
    uint32_t up_time = (cur_time - idigi_config.start_time);
    return up_time;
}

void sleep(unsigned int ms){
    unsigned int wait, start;

