jordanh/idigi-arduino-connector/dvt/platforms/pic32/ethstarterkit32.X/main.c
	// Get proper values for the validation structure indicating that we can use
	// these EEPROM/Flash contents on future boot ups
	NVMValidationStruct.wOriginalChecksum = wOriginalAppConfigChecksum;
	NVMValidationStruct.wCurrentChecksum = CalcIPChecksum((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));
	NVMValidationStruct.wConfigurationLength = sizeof(APP_CONFIG);

	// Write the validation struct and current AppConfig contents to EEPROM/Flash
	#if defined(EEPROM_CS_TRIS)
	    XEEBeginWrite(0x0000);
	    XEEWriteArray((BYTE*)&NVMValidationStruct, sizeof(NVMValidationStruct));
		XEEWriteArray((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));
    #else
		SPIFlashBeginWrite(0x0000);
		SPIFlashWriteArray((BYTE*)&NVMValidationStruct, sizeof(NVMValidationStruct));
		SPIFlashWriteArray((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));
    #endif
}
#endif

static void InitIDigiConfig(void){
    // Start out zeroing all IDigiConfig bytes to ensure all fields are
    // deterministic for checksum generation.
    memset((void*)&idigi_config, 0x00, sizeof(idigi_config));
    idigi_config.start_time = TickGet() / TICKS_PER_SECOND;
    // TODO: Derive Device Type.
    idigi_config.device_type = "PIC32 Ethernet Starter Kit";
    idigi_config.rx_keepalive = 30;
    idigi_config.tx_keepalive = 30;
    idigi_config.wait_count = 3;
    idigi_config.vendor_id[0] = 1;
    idigi_config.vendor_id[1] = 0;
    idigi_config.vendor_id[2] = 0;
    idigi_config.vendor_id[3] = 5;
    idigi_config.server_url = "test.idigi.com";
    idigi_config.connection_type = idigi_lan_connection_type;
    idigi_config.socket_fd = -1;
    idigi_config.connected = false;
}

idigi_callback_status_t idigi_callback(idigi_class_t const class_id,
                                        idigi_request_t const request_id,
                                        void const * const request_data,
                                        size_t const request_length,
                                        void * response_data,
                                        size_t * const response_length){

    idigi_callback_status_t status = idigi_callback_continue;
    
    switch(class_id){
        case idigi_class_config:
            status = idigi_config_callback(request_id.config_request,
                    request_data, response_data, response_length);
            break;
        case idigi_class_operating_system:
            status = idigi_os_callback(request_id.os_request,
                    request_data, response_data);
            break;
        case idigi_class_network:
            status = idigi_network_callback(request_id.network_request,
                    request_data, response_data, response_length);
    }

    return status;
}